<?php
#所有的错误代码key都是大写，定义的数字code如果涉及到业务逻辑，请说明
return [
    ####################################与前端约定错误CODE,不能修改 1000开始##########################
    'USER_NO_LOGIN'                => ['账号登录失败', 10000],//登录态失效/过期等统一使用此code

    ####################################系统错误#############################################
    'SYSTEM_ERROR'                 => ['系统异常', 99000000],
    'REQUEST_TIMED_OUT'            => ['请求超时', 99000001],
    'INVALID_ARGUMENT'             => ['参数校验错误', 2],
    'RPC_SERVICE_ERROR'            => ['调用RPC服务异常', 99000003],
    'API_ONLY_DEV_OPEN'            => ['此api仅允许在开发环境调用，还未对外开放', 99000004],
    'EXPIRED_TOKEN'                => ['过期token值', 99000005],
    'WEXIN_AUTH_FAILED'            => ['获取微信授权失败', 99000006],

    ####################################用户相关10000000~19999999#############################
    'USER_NOT_FOUND'               => ['用户不存在', 10000001],
    'UNIONLOGIN_BUNDLE_FAILED'     => ['用户绑定失败', 10000002],
    'UNIONLOGIN_UNBUNDLE_FAILED'   => ['用户解绑失败', 10000003],
    'SIGNATURE_AUTH_FAILED'        => ['签名验证失败', 10000004],
    'INVALID_MOBILE_NUMBER'        => ['非法的手机号', 10000005],
    'USER_BIND_THIRD_ACCOUNT_DONE' => ['用户已经绑定第三方账号', 10000006],
    'THIRD_ACCOUNT_BIND_USER_DONE' => ['第三方账号已经绑定用户', 10000007],
    'USER_LOGIN_FAILED'            => ['用户名/密码错误', 10000008],
    'INVALID_SMS_CODE'             => ['短信验证码错误', 10000009],
    'PHONE_ALREADY_BIND'           => ['手机号已经被绑定', 100000011],
    'SMS_SCENE_INVALID'            => ['短信发送场景无效', 100000012],
    'PHONE_EXISTS'                 => ['手机号已经存在', 100000013],
    'PAY_PWD_ERROR'                => ['支付密码错误', 100000014],
    ####################################地址相关12000000~12999999#############################

    ####################################红包相关13000000~13999999#############################
    'PACKET_CREATE_FAIL'           =>['红包创建失败',13000001],
    'INVALID_PACKET_ID'            =>['不合法的红包ID',13000002],
    ####################################订单相关20000000~29999999#############################

    ####################################购物车相30000000~39999999#############################
    'CART_IS_EMPTY'                => ['购物车为空', 300000001],
    ####################################支付相关40000000~49999999#############################

];

